![data-x](http://oi64.tinypic.com/o858n4.jpg)

___

## Homework 04

## NAME:  Shubei Wang

## STUDENT ID: 3034358656

In [3]:
# Load required modules
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

## Pandas Introduction


##  Reading File

#### 1.1) Read the CSV file called 'data3.csv' into a dataframe called df. 
#### Data description
* Data source: http://www.fao.org/nr/water/aquastat/data/query/index.html?* lang=en
* Data, units:
* GDP, current USD (CPI adjusted)
* NRI, mm/yr
* Population density, inhab/km^2
* Total area of the country, 1000 ha = 10km^2
* Total Population, unit 1000 inhabitants

In [80]:
df = pd.read_csv('data3.csv')

#### 2.1 ) Display the first 10 rows of the dataframe

In [19]:
df.head(10)

,Area,Area Id,Variable Name,Variable Id,Year,Value,Symbol,Other
0,Argentina,9.0,Total area of the country,4100.0,1962.0,278040.0,E,NaN
1,Argentina,9.0,Total area of the country,4100.0,1967.0,278040.0,E,NaN
2,Argentina,9.0,Total area of the country,4100.0,1972.0,278040.0,E,NaN
3,Argentina,9.0,Total area of the country,4100.0,1977.0,278040.0,E,NaN
4,Argentina,9.0,Total area of the country,4100.0,1982.0,278040.0,E,NaN
5,Argentina,9.0,Total area of the country,4100.0,1987.0,278040.0,E,NaN
6,Argentina,9.0,Total area of the country,4100.0,1992.0,278040.0,E,NaN
7,Argentina,9.0,Total area of the country,4100.0,1997.0,278040.0,E,NaN
8,Argentina,9.0,Total area of the country,4100.0,2002.0,278040.0,E,NaN
9,Argentina,9.0,Total area of the country,4100.0,2007.0,278040.0,E,NaN

#### 2.2 ) Display the column names.

In [35]:
df.columns

Index(['Area', 'Area Id', 'Variable Name', 'Variable Id', 'Year', 'Value',
       'Symbol'],
      dtype='object')

#### 2.3) Use iloc to display the first 3 rows and first 4 columns.

In [12]:
df.iloc[0:3,0:4]

        Area  Area Id              Variable Name  Variable Id
0  Argentina      9.0  Total area of the country       4100.0
1  Argentina      9.0  Total area of the country       4100.0
2  Argentina      9.0  Total area of the country       4100.0



## Data Preprocessing

#### 3.1 ) Find all the rows that  have 'NaN' in the 'Symbol' column. Display first 5 rows.

##### Hint : You might have to use a mask

In [24]:
df[df['Symbol'].isnull()].head(5)

,Area,Area Id,Variable Name,Variable Id,Year,Value,Symbol,Other
390,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
391,E - External data,NaN,NaN,NaN,NaN,NaN,NaN,NaN
392,I - AQUASTAT estimate,NaN,NaN,NaN,NaN,NaN,NaN,NaN
393,K - Aggregate data,NaN,NaN,NaN,NaN,NaN,NaN,NaN
394,L - Modelled data,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### 3.2 )  Now, we will try to get rid of the NaN valued rows and columns. First, drop the column 'Other' which only has 'NaN' values. Then drop all other rows that have any column with a value 'NaN'.  Then display the last 5 rows of the dataframe.

In [81]:
df.drop('Other',axis=1,inplace=True)
df1 = df.copy()
for i in df1.index:
    if(True in list(df1.iloc[i].isnull())):
        df.drop(i, axis=0, inplace=True)
df.tail(5)

,Area,Area Id,Variable Name,Variable Id,Year,Value,Symbol
385,United States of America,231.0,National Rainfall Index (NRI),4472.0,1981.0,949.2,E
386,United States of America,231.0,National Rainfall Index (NRI),4472.0,1984.0,974.6,E
387,United States of America,231.0,National Rainfall Index (NRI),4472.0,1992.0,1020.0,E
388,United States of America,231.0,National Rainfall Index (NRI),4472.0,1996.0,1005.0,E
389,United States of America,231.0,National Rainfall Index (NRI),4472.0,2002.0,938.7,E

#### 4.1) For our analysis we do not want all the columns in our dataframe. Lets  drop all the redundant columns/ features.   
#### **Drop columns**: **Area Id, Variable Id, Symbol**. Save the new dataframe as df1. Display the first 5 rows of the new dataframe.

In [83]:
df1 = df.drop(['Area Id', 'Variable Id', 'Symbol'],axis=1)
df1.head(5)

        Area              Variable Name    Year     Value
0  Argentina  Total area of the country  1962.0  278040.0
1  Argentina  Total area of the country  1967.0  278040.0
2  Argentina  Total area of the country  1972.0  278040.0
3  Argentina  Total area of the country  1977.0  278040.0
4  Argentina  Total area of the country  1982.0  278040.0

#### 4.2) Display all the unique values in your new dataframe for columns: Area, Variable Name, Year.

In [97]:
[pd.unique(df1.iloc[:,i]) for i in range(3)]

[array(['Argentina', 'Australia', 'Germany', 'Iceland', 'Ireland',
        'Sweden', 'United States of America'], dtype=object),
 array(['Total area of the country', 'Total population',
        'Population density', 'Gross Domestic Product (GDP)',
        'National Rainfall Index (NRI)'], dtype=object),
 array([1962., 1967., 1972., 1977., 1982., 1987., 1992., 1997., 2002.,
        2007., 2012., 2014., 2015., 1963., 1970., 1974., 1978., 1984.,
        1990., 1964., 1981., 1985., 1996., 2001., 1969., 1973., 1979.,
        1993., 1971., 1975., 1986., 1991., 1998., 2000., 1965., 1983.,
        1988., 1995.])]

#### 4.3) Convert the Year column to pandas datetime. Convert the 'Year' column float values to pandas datetime objects, where each year is represented as the first day of that year. Also display the first 5 values of column after conversion.

##### For eg: 1962.0 will be represented as 1962-01-01

In [ ]:
# your code here

## Plot

#### 5.1) Use pandas to plot a bar graph showing the count for each unique value in the column 'Area'. Give it a title.

In [ ]:
# your code here

## Extract specific statistics from the preprocessed data:

#### 6.1)  Create a dataframe 'dftemp' to store rows where Area is 'Iceland'. Display the dataframe.

In [ ]:
# your code here

#### 7.1) Print the years when the National Rainfall Index (NRI) was greater than 900 and less than 950 in Iceland. Use the dataframe you created in the previous question 'dftemp'.

In [ ]:
# your code here

## US statistics:

#### 8.1) Create a new DataFrame called **`df_usa`** that only contains values where 'Area' is equal to 'United States of America'. Set the indices to be the 'Year' column    ( Use .set_index( ) ). Display the dataframe head.

In [ ]:
# your code here


#### 8.2) Pivot the DataFrame so that the unique values in the column 'Variable Name' becomes the columns. The DataFrame values should be the ones in the the 'Value' column. Save it in df_usa. Display the dataframe head.

In [ ]:
# your code here

#### 8.3) Rename new columns to  ['GDP','NRI','PD','Area','Population'] and display the head.

In [ ]:
# your code here

#### 8.4) Replace all 'Nan' values in df_usa with 0. Display the head of the dataframe.

In [ ]:
# your code here

## Use df_usa:

#### 9.1 Multiply the 'Area' column for all countries by 10 (so instead of 1000 ha, the unit becomes 100 ha = 1km^2). Display the dataframe head.

In [ ]:
# your code here


#### 9.2: Create a new column in df_usa called 'GDP/capita' and populate it with the calculated GDP per capita. Round the results to two decimal points. Display the dataframe head.
GDP per capita = (GDP / Population) * 1000

In [ ]:
# your code here


#### 9.3: Find the maximum value of the 'NRI' column in the US (using pandas methods). What year does the max value occur? Display the values.

In [ ]:
# your code here